// [STEPIK]
// Java. Базовый курс https://stepik.org/course/187
// 01_02_14 Первый контакт — Hello World

/*
Напишите программу, выводящую в консоль It's alive! It's alive!

Класс должен называться "Main", это ограничение проверяющей системы.

Sample Input:
Sample Output:
It's alive! It's alive!
*/

public class Alive {
  public static void main(String[] args) {
    System.out.println("It's alive! It's alive!");
  }
}